backend/controllers/ArticleController.php

SELECT * FROM `article` WHERE `id`='31'
---
    protected function findModel($id)
    {
        if (($model = Article::findOne($id)) !== null) {